ERP.belugaerp/src/InformationRegisters/бг_ИдентификаторыМарок/бг_ИдентификаторыМарок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_ИдентификаторыМарок</name>
  <resources>
    <name>НомерМарки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторМарки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СерияФСМ</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ОрганизацияЕГАИС</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </resources>
  <dimensions>
    <name>ГУИДМарки</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/бг_СоставУпаковок/бг_СоставУпаковок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_СоставУпаковок</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КодВышестоящейУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>26</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КодУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>26</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/Enums/ВидыДокументовЕГАИС/ВидыДокументовЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВидыДокументовЕГАИС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>АктПостановкиНаБалансВРегистр1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктПостановкиНаБалансВРегистр2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктПостановкиНаБалансВРегистр3</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктСписанияИзРегистра1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктСписанияИзРегистра2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктСписанияИзРегистра3</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктТТНОтказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктТТНПодтверждение</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктТТНРасхождения</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>бг_АктОбУничтоженииФСМ</name>
  </enumValues>
  <enumValues>
    <name>бг_ДобавлениеНовойПродукцииЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>бг_ЗапросНаОтменуПроведенияАктаОбУничтожении</name>
  </enumValues>
  <enumValues>
    <name>бг_ЗапросНаОтменуПроведенияОтчетаОбИмпорте</name>
  </enumValues>
  <enumValues>
    <name>бг_ЗапросНаОтменуПроведенияОтчетаОПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>бг_ЗапросНаОтменуПроведенияПланируемогоВвоза</name>
  </enumValues>
  <enumValues>
    <name>бг_ЗапросССП</name>
  </enumValues>
  <enumValues>
    <name>бг_ЗаявлениеОВыдачеФСМ</name>
  </enumValues>
  <enumValues>
    <name>бг_КвитанцияОтчетОбИспользованииФСМ</name>
    <comment>ReportUsingFSM</comment>
  </enumValues>
  <enumValues>
    <name>бг_НакладнаяНаВыдачуФСМ</name>
  </enumValues>
  <enumValues>
    <name>бг_ОтветНаЗапросССП</name>
  </enumValues>
  <enumValues>
    <name>бг_ОтчетОбИмпортеПродукцииЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>бг_ОтчетОПроизводствеЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>бг_УведомлениеОНачалеОборотаНаТерриторииРФАПЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>бг_ПланируемыйВвозЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>бг_УведомлениеОРегистрацииДвиженияОтчетаОбИмпортеПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ЗапросАлкогольнойПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросДанныхОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросНаОтменуПроведенияАктаСписания</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросНаОтменуПроведенияТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОстатковВРегистре1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОстатковВРегистре2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаДвиженияМеждуРегистрами</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаДвиженияПоСправке2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаИнформацияОбОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаИсторияСправок2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаНеобработанныеТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаОбработанныеЧеки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаОстаткиВРегистре1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаОстаткиВРегистре2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаОстаткиВРегистре3</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросПроверкиАкцизныхМарокНаОстаткахОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросСправки1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросСправки2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ИсторияСправок2ПоТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Квитанция</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КвитанцияАктаРасхождений</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КвитанцияАктаРасхожденийПодтверждение</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КвитанцияВходящейТранспортнойНакладной</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КвитанцияЗапросаНаОтменуПроведенияТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КвитанцияПолученЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КвитанцияПроведенЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросАкцизныхМарок</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросАлкогольнойПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросДанныхОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОстатковВРегистре1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОстатковВРегистре2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаДвиженияМеждуРегистрами</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаДвиженияПоСправке2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаИнформацияОбОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаИсторияСправок2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаНеобработанныеТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаОбработанныеЧеки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаОстаткиВРегистре1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаОстаткиВРегистре2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаОстаткиВРегистре3</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросПроверкиАкцизныхМарокНаОстаткахОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросСправки1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросСправки2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ТранспортнаяНакладная</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>УведомлениеОРегистрацииДвиженияАктаПостановкиНаБаланс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>УведомлениеОРегистрацииДвиженияТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/бг_СтатусыАкцизныхМарок/бг_СтатусыАкцизныхМарок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_СтатусыАкцизныхМарок</name>
  <enumValues>
    <name>ВключенаВАктПостановкиНаБаланс</name>
  </enumValues>
  <enumValues>
    <name>ВключенаВАктСписания</name>
  </enumValues>
  <enumValues>
    <name>ВключенаВДокументВозврата</name>
  </enumValues>
  <enumValues>
    <name>ВключенаВОтгрузку</name>
  </enumValues>
  <enumValues>
    <name>ВключенаВОтчетОбУничтожении</name>
  </enumValues>
  <enumValues>
    <name>ВключенаВЭтапПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ВНаличии</name>
  </enumValues>
  <enumValues>
    <name>Возвращена</name>
  </enumValues>
  <enumValues>
    <name>Выбыла</name>
  </enumValues>
  <enumValues>
    <name>КОприходованию</name>
  </enumValues>
  <enumValues>
    <name>НаБалансе</name>
  </enumValues>
  <enumValues>
    <name>Оклеена</name>
  </enumValues>
  <enumValues>
    <name>ПодготовленаКУничтожению</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденаНаСкладе</name>
  </enumValues>
  <enumValues>
    <name>Пропущена</name>
  </enumValues>
  <enumValues>
    <name>Уничтожена</name>
  </enumValues>
  <enumValues>
    <name>ВключенаВОтгрузкуОбработаноЕГАИС</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/CommonModules/бг_битОтчетОПроизводствеЕГАИСИнтеграция/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСоставВыгружаемыхОбъектов(РеквизитыИСвойства, ФорматСообщения, СтандартнаяОбработка) Экспорт
	ДобавитьСвязанныеРеквизитыКВыгрузке(РеквизитыИСвойства, ФорматСообщения);
КонецПроцедуры

Процедура ЗаполнитьТекстыЗапросовУсловиями(ТекстЗапроса, ТекстЗапросаТаблицаКлючей, ПараметрыЗапроса, НастройкаВыгрузки, Объект, СтандартнаяОбработка) Экспорт
	СтрокаКонецЗапроса = ") КАК Сырьё";
	ТекстЗапроса = Лев(ТекстЗапроса, СтрНайти(ТекстЗапроса, СтрокаКонецЗапроса) + СтрДлина(СтрокаКонецЗапроса) - 1);
	ТекстЗапроса = ТекстЗапроса + "
		|ИЗ
		|	Документ.битОтчетОПроизводствеЕГАИС КАК ВыгружаемыйОбъект
		|ГДЕ
		|	&УсловиеЗапроса";
КонецПроцедуры

Функция ПолучитьДанныеВыгружаемогоОбъекта(Объект, ДанныеСообщения) Экспорт
	
	Перем адаптер_РаботаСДаннымиИБ, адаптер_обработчикиСобытийСтандартный;
	адаптер_РаботаСДаннымиИБ = ОбщегоНазначения.ОбщийМодуль("адаптер_РаботаСДаннымиИБ");
	адаптер_обработчикиСобытийСтандартный = ОбщегоНазначения.ОбщийМодуль("адаптер_обработчикиСобытийСтандартный");
	
	ПараметрыВыполненияЗапросов = адаптер_РаботаСДаннымиИБ.ПолучитьПараметрыВыполненияЗапросов(Объект, ДанныеСообщения);
	ДанныеОбъекта = адаптер_обработчикиСобытийСтандартный.ПолучитьДанныеВыгружаемогоОбъекта(Объект, ДанныеСообщения);
	
	Если ДанныеОбъекта.Реквизиты.Количество() > 0 Тогда
		РеквизитыОбъекта = ДанныеОбъекта.Реквизиты[0];    
		ЗаполнитьСвязанныеРеквизиты(РеквизитыОбъекта, Объект);
		ДобавитьДанныеОМаркахУпаковках(РеквизитыОбъекта, Объект, ДанныеСообщения, ПараметрыВыполненияЗапросов);
	КонецЕсли;
	
	Возврат ДанныеОбъекта;
КонецФункции

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьСвязанныеРеквизиты(РеквизитыОбъекта, Объект)
	Операции = Новый Массив;
	Операции.Добавить(Перечисления.ВидыДокументовЕГАИС.АктТТНПодтверждение);
	Операции.Добавить(Перечисления.ВидыДокументовЕГАИС.бг_ОтчетОПроизводствеЕГАИС);
	
	РеквизитыОбъекта.Вставить("бг_ЕстьДвиженияЕГАИС", 
		бг_ТТНВходящаяЕГАИСИнтеграция.ЕстьДвиженияЕАГИС(Объект));
	РеквизитыОбъекта.Вставить("ИдентификаторЗапросаУТМ", 
		бг_ТТНВходящаяЕГАИСИнтеграция.ИдентификаторЗапросаЕГАИС(Объект, Операции));
	РеквизитыОбъекта.Вставить("СтатусДокумента", 
		Строка(РегистрыСведений.СтатусыДокументовЕГАИС.ТекущееСостояние(Объект).Статус));
КонецПроцедуры

Процедура ДобавитьДанныеОМаркахУпаковках(РеквизитыОбъекта, Объект, ДанныеСообщения, ПараметрыВыполненияЗапросов)

	ДанныеМарокУпаковок = ДанныеМарокУпаковокПоЭтапуПроизводства(Объект);
	
	РеквизитыОбъекта.Вставить("Марки", ДиапазоныМарок(ДанныеМарокУпаковок.Марки));	
	бг_МаркируемаяПродукция.ДобавитьДанныеОбАкцизныхМаркахВРеквизитыСообщения(
		РеквизитыОбъекта, Объект, ДанныеМарокУпаковок);

КонецПроцедуры

Функция ДиапазоныМарок(ТаблицаМарок)
	
	Результат = Новый Массив;
	
	НачалоДиапазона = -2;
	КонецДиапазона = -2;
	Для каждого СтрокаМарки Из ТаблицаМарок Цикл
		Если СтрокаМарки.НомерМарки = КонецДиапазона + 1 Тогда
			КонецДиапазона = СтрокаМарки.НомерМарки;
		Иначе
			ДобавитьСтрокуДиапазона(Результат, НачалоДиапазона, КонецДиапазона);
			НачалоДиапазона = СтрокаМарки.НомерМарки;
			КонецДиапазона = СтрокаМарки.НомерМарки;
		КонецЕсли;
	КонецЦикла;
	ДобавитьСтрокуДиапазона(Результат, НачалоДиапазона, КонецДиапазона);
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьСтрокуДиапазона(МассивСтрок, НачалоДиапазона, КонецДиапазона)
	Если КонецДиапазона > 0 Тогда
		МассивСтрок.Добавить(СтруктураДиапазон(НачалоДиапазона, КонецДиапазона));
	КонецЕсли;
КонецПроцедуры

Функция СтруктураДиапазон(НачалоДипазона, КонецДипазона) 
	Результат = Новый Структура;
	НачалоДиапазонаСтрока = Формат(НачалоДипазона, "ЧГ=0");
	КонецДиапазонаСтрока = Формат(КонецДипазона, "ЧГ=0");
	НомерСимволаРазряд = 4;
	ДлинаСтрРазряда = 3;
	ДлинаСтрДиапазона = 8;
	Результат.Вставить("КлючСвязи", 1);
	Результат.Вставить("Разряд", Сред(НачалоДиапазонаСтрока, НомерСимволаРазряд, ДлинаСтрРазряда));
	Результат.Вставить("ДиапазонС", Прав(НачалоДиапазонаСтрока, ДлинаСтрДиапазона));
	Результат.Вставить("ДиапазонПо", Прав(КонецДиапазонаСтрока, ДлинаСтрДиапазона));
	Возврат Результат;
КонецФункции

Функция ДанныеМарокУпаковокПоЭтапуПроизводства(ОтчетОПроизводствеЕГАИС)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭтапПроизводства2_2.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втЭтапы
	|ИЗ
	|	Документ.битОтчетОПроизводствеЕГАИС КАК битОтчетОПроизводствеЕГАИС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
	|		ПО битОтчетОПроизводствеЕГАИС.ДокументОснование = ЭтапПроизводства2_2.Ссылка
	|			И (битОтчетОПроизводствеЕГАИС.Ссылка = &ОтчетОПроизводствеЕГАИС)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бг_ДвижениеМарок.КодУпаковки КАК НомерКоробки,
	|	бг_ИдентификаторыМарок.ИдентификаторМарки КАК КодАкцизнойМарки,
	|	бг_ИдентификаторыМарок.НомерМарки КАК НомерМарки
	|ПОМЕСТИТЬ втДанные
	|ИЗ
	|	втЭтапы КАК втЭтапы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бг_ДвижениеМарок КАК бг_ДвижениеМарок
	|		ПО втЭтапы.Ссылка = бг_ДвижениеМарок.Регистратор
	|			И (бг_ДвижениеМарок.СтатусМарки = ЗНАЧЕНИЕ(Перечисление.бг_СтатусыАкцизныхМарок.ВключенаВЭтапПроизводства))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бг_ИдентификаторыМарок КАК бг_ИдентификаторыМарок
	|		ПО (бг_ДвижениеМарок.ГУИДМарки = бг_ИдентификаторыМарок.ГУИДМарки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК КлючСвязи,
	|	втДанные.НомерКоробки КАК НомерКоробки,
	|	втДанные.КодАкцизнойМарки КАК КодАкцизнойМарки
	|ИЗ
	|	втДанные КАК втДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанные.НомерМарки КАК НомерМарки
	|ИЗ
	|	втДанные КАК втДанные
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерМарки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Упаковка КАК Упаковка,
	|	МИНИМУМ(ВложенныйЗапрос.ИерархияУпаковки) КАК ИерархияУпаковки
	|ИЗ
	|	(ВЫБРАТЬ
	|		втДанные.НомерКоробки КАК Упаковка,
	|		бг_СоставУпаковок.КодВышестоящейУпаковки КАК ИерархияУпаковки
	|	ИЗ
	|		втДанные КАК втДанные
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бг_СоставУпаковок КАК бг_СоставУпаковок
	|			ПО втДанные.НомерКоробки = бг_СоставУпаковок.КодУпаковки
	|				И (бг_СоставУпаковок.Регистратор ССЫЛКА Документ.битДанныеСПроизводственнойЛинии)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		бг_СоставУпаковок.КодВышестоящейУпаковки,
	|		""""
	|	ИЗ
	|		втДанные КАК втДанные
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бг_СоставУпаковок КАК бг_СоставУпаковок
	|			ПО втДанные.НомерКоробки = бг_СоставУпаковок.КодУпаковки
	|				И (бг_СоставУпаковок.Регистратор ССЫЛКА Документ.битДанныеСПроизводственнойЛинии)) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Упаковка";
	Запрос.УстановитьПараметр("ОтчетОПроизводствеЕГАИС", ОтчетОПроизводствеЕГАИС);	
	РезультатЗапросаПакет = Запрос.ВыполнитьПакет();
	
	Результат = Новый Структура;
	Результат.Вставить("Упаковки",		РезультатЗапросаПакет[РезультатЗапросаПакет.ВГраница()].Выгрузить());
	Результат.Вставить("Марки",			РезультатЗапросаПакет[РезультатЗапросаПакет.ВГраница() - 1].Выгрузить());
	Результат.Вставить("АкцизныеМарки",	РезультатЗапросаПакет[РезультатЗапросаПакет.ВГраница() - 2].Выгрузить());
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьСвязанныеРеквизитыКВыгрузке(РеквизитыИСвойства, ФорматСообщения)
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	#Область ШапкаДокумента
	адаптер_НастройкиОбмена.ДобавитьРеквизит(РеквизитыИСвойства, РеквизитыИСвойства.МетаданныеОбъекта, ,
		"ИдентификаторЗапросаУТМ", ОбщегоНазначения.ОписаниеТипаСтрока(36));
	адаптер_НастройкиОбмена.ДобавитьРеквизит(РеквизитыИСвойства, РеквизитыИСвойства.МетаданныеОбъекта, ,
		"СтатусДокумента", ОбщегоНазначения.ОписаниеТипаСтрока(128));
	адаптер_НастройкиОбмена.ДобавитьРеквизит(РеквизитыИСвойства, РеквизитыИСвойства.МетаданныеОбъекта, ,
		"бг_ЕстьДвиженияЕГАИС", Новый ОписаниеТипов("Булево"));
	адаптер_НастройкиОбмена.ДобавитьРеквизит(РеквизитыИСвойства, РеквизитыИСвойства.МетаданныеОбъекта, ,
		"бг_ВариантВыгрузкиМарокУпаковок", ОбщегоНазначения.ОписаниеТипаСтрока(25));
	адаптер_НастройкиОбмена.ДобавитьРеквизит(РеквизитыИСвойства, РеквизитыИСвойства.МетаданныеОбъекта, ,
		"бг_ИмяФайлаВыгрузкиМарокУпаковок", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	#КонецОбласти 
	
	#Область ТабличнаяЧастьМарки
	адаптер_НастройкиОбмена.ДобавитьРеквизит(РеквизитыИСвойства, РеквизитыИСвойства.МетаданныеОбъекта,	, 
		"Марки.КлючСвязи", ОбщегоНазначения.ОписаниеТипаЧисло(10));
	адаптер_НастройкиОбмена.ДобавитьРеквизит(РеквизитыИСвойства, РеквизитыИСвойства.МетаданныеОбъекта,	, 
		"Марки.Разряд", ОбщегоНазначения.ОписаниеТипаСтрока(10));
	адаптер_НастройкиОбмена.ДобавитьРеквизит(РеквизитыИСвойства, РеквизитыИСвойства.МетаданныеОбъекта,	, 
		"Марки.ДиапазонС", ОбщегоНазначения.ОписаниеТипаСтрока(10));
	адаптер_НастройкиОбмена.ДобавитьРеквизит(РеквизитыИСвойства, РеквизитыИСвойства.МетаданныеОбъекта,	, 
		"Марки.ДиапазонПо", ОбщегоНазначения.ОписаниеТипаСтрока(10));
	#КонецОбласти 
	
	#Область ТабличнаяЧастьАкцизныеМарки
	адаптер_НастройкиОбмена.ДобавитьРеквизит(РеквизитыИСвойства, РеквизитыИСвойства.МетаданныеОбъекта,	, 
		"АкцизныеМарки.КодАкцизнойМарки", ОбщегоНазначения.ОписаниеТипаСтрока(160));
	адаптер_НастройкиОбмена.ДобавитьРеквизит(РеквизитыИСвойства, РеквизитыИСвойства.МетаданныеОбъекта,	, 
		"АкцизныеМарки.КлючСвязи", ОбщегоНазначения.ОписаниеТипаЧисло(5));
	адаптер_НастройкиОбмена.ДобавитьРеквизит(РеквизитыИСвойства, РеквизитыИСвойства.МетаданныеОбъекта,	, 
		"АкцизныеМарки.НомерКоробки", ОбщегоНазначения.ОписаниеТипаСтрока(120));
	#КонецОбласти 	
	
	#Область ТабличнаяЧастьУпаковки
	адаптер_НастройкиОбмена.ДобавитьРеквизит(РеквизитыИСвойства, РеквизитыИСвойства.МетаданныеОбъекта,	, 
		"Упаковки.Упаковка", ОбщегоНазначения.ОписаниеТипаСтрока(120));
	адаптер_НастройкиОбмена.ДобавитьРеквизит(РеквизитыИСвойства, РеквизитыИСвойства.МетаданныеОбъекта,	, 
		"Упаковки.ИерархияУпаковки", ОбщегоНазначения.ОписаниеТипаСтрока(120));
	#КонецОбласти 	
	
КонецПроцедуры

#КонецОбласти
